<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img
 src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/alx-courses/aice/assets/Content_page_banner_blue_dots.png"
 alt="ALX Content Header"
 class="full-width-image"
/>
</div>

# Using logical and comparison operators

> ⚠️ This notebook will not run on Google Colab because it cannot connect to a local database. Please make sure that this notebook is running on the same local machine as your MySQL Workbench installation and MySQL `united_nations` database.

## Learning Objectives

- Understand the concept of logic and comparison operators in SQL.
- Learn how to use the WHERE clause to filter data based on specific conditions.
- Understand the use of IN, BETWEEN, and other SQL operators to streamline queries.

## Overview

In this notebook, we will explore the use of logic and comparison operators in SQL to filter and extract specific data from a dataset. These operators are essential tools in SQL that allow us to narrow down our data based on certain conditions.

We will be working with the `united_nations.Access_to_Basic_Services` table, which contains information about different countries, their GDP, access to basic services, and more.

### Connecting to our MySQL database

Since we have a MySQL database, we can connect to it using mysql and pymysql.

In [1]:
# load and activate the SQL extension to allows us to execute SQL in a Jupyter notebook

%load_ext sql

In [2]:
# establish a connection to the local database using the '%sql' magic command,
# replace 'password' with our connection password and `db_name` with our database name

%sql mysql+pymysql://root:password@localhost:3306/united_nations

'Connected: root@united_nations'

## Exercise

### Task 1: Basic Filtering with Comparison Operators

You will be working with the `united_nations.Access_to_Basic_Services` table.
The columns to `SELECT` include 
- `Country_name`
- `Time_period`
- `Pct_managed_drinking_water_services`
- `Pct_managed_sanitation_services`
- `Est_population_in_millions`
- and `Est_gdp_in_billions`


Use the `WHERE` clause to filter out records of specific countries: 
- `Nigeria`, 
- `Ethiopia`, 
- `Congo`, 
- `Egypt`, 
- `Tanzania`, 
- `Kenya`, 
- and `South Africa`
- for the time period between `2019` and `2020`.
Utilize the `OR` operator to include multiple countries in your filter.

In [4]:
%%sql
-- Add your code here
select Country_name, Time_period, Pct_managed_drinking_water_services, Pct_managed_sanitation_services, Est_population_in_millions, Est_gdp_in_billions
from access_to_basic_services
where (
    Country_name = 'Nigeria' or
    Country_name = 'Ethiopia' or
    Country_name = 'Congo' or
    Country_name = 'Egypt' or
    Country_name = 'Tanzania' or
    Country_name = 'Kenya')
    and time_period between 2019 and 2020

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Egypt', 2019, Decimal('99.33'), Decimal('97.00'), None, None),
 ('Egypt', 2020, Decimal('99.33'), Decimal('97.67'), None, None),
 ('Ethiopia', 2019, Decimal('57.00'), Decimal('11.67'), Decimal('114.120594'), Decimal('95.91')),
 ('Ethiopia', 2020, Decimal('58.00'), Decimal('11.67'), Decimal('117.190911'), Decimal('107.66')),
 ('Kenya', 2019, Decimal('66.33'), Decimal('33.33'), Decimal('50.951450'), Decimal('100.38')),
 ('Kenya', 2020, Decimal('67.00'), Decimal('33.67'), Decimal('51.985780'), Decimal('100.67')),
 ('Congo', 2019, Decimal('69.00'), Decimal('17.67'), None, None),
 ('Congo', 2020, Decimal('69.00'), Decimal('17.67'), None, None),
 ('Nigeria', 2019, Decimal('75.67'), Decimal('41.67'), Decimal('203.304492'), Decimal('448.12')),
 ('Nigeria', 2020, Decimal('77.33'), Decimal('42.67'), Decimal('208.327405'), Decimal('432.20'))]

### Task 2: Streamlining with the IN Operator

Building on the first task, you might have noticed that using multiple `OR` operators can make the query lengthy and a bit complicated. The 'IN' operator offers a more efficient way to achieve the same result.
The `IN` operator allows you to specify multiple values in a `WHERE` clause, making the query more concise.
Try to retrieve data for the same list of countries for the same time range, but this time, use the `IN` operator to simplify your query.

In [6]:
%%sql
-- Add your code here
select Country_name, Time_period, Pct_managed_drinking_water_services, Pct_managed_sanitation_services, Est_population_in_millions, Est_gdp_in_billions
from access_to_basic_services
where Country_name in (
    'Nigaria', 'Ethiopia', 'Congo', 'Egypt', 'Tanzania', 'Kenya', 'South Africa'
) and time_period between 2019 and 2020

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Egypt', 2019, Decimal('99.33'), Decimal('97.00'), None, None),
 ('Egypt', 2020, Decimal('99.33'), Decimal('97.67'), None, None),
 ('Ethiopia', 2019, Decimal('57.00'), Decimal('11.67'), Decimal('114.120594'), Decimal('95.91')),
 ('Ethiopia', 2020, Decimal('58.00'), Decimal('11.67'), Decimal('117.190911'), Decimal('107.66')),
 ('Kenya', 2019, Decimal('66.33'), Decimal('33.33'), Decimal('50.951450'), Decimal('100.38')),
 ('Kenya', 2020, Decimal('67.00'), Decimal('33.67'), Decimal('51.985780'), Decimal('100.67')),
 ('Congo', 2019, Decimal('69.00'), Decimal('17.67'), None, None),
 ('Congo', 2020, Decimal('69.00'), Decimal('17.67'), None, None),
 ('South Africa', 2019, Decimal('91.67'), Decimal('78.00'), Decimal('58.087055'), Decimal('388.53')),
 ('South Africa', 2020, Decimal('92.00'), Decimal('78.67'), Decimal('58.801927'), Decimal('337.62'))]

### Task 3: Combining Multiple Conditions

The `<=` operator is a comparison operator that checks if the value on the left is less than or equal to the value on the right. In this task, you'll use it to filter countries based on specific service percentages.
You'll continue working with the `united_nations.Access_to_Basic_Services` table.
The columns to be selected for this task are 
- `Region`, 
- `Country_name`, 
- `Time_period`, 
- `Pct_managed_drinking_water_services`, 
- `Pct_managed_sanitation_services`, 
- `Est_population_in_millions`, and 
- `Est_gdp_in_billions`.

Your goal is to extract data for the year 2020, focusing on countries where less than or equal to 50% of the population has access to sanitation services. This will help identify countries with critical sanitation needs.
By using the `<=` operator with the `Pct_managed_sanitation_services` column, you can filter out countries that exceed this threshold, leaving only those with the most pressing sanitation challenges.

In [7]:
%%sql
-- Add your code here
select Country_name, Time_period, Pct_managed_drinking_water_services, Pct_managed_sanitation_services, Est_population_in_millions, Est_gdp_in_billions
from access_to_basic_services
where time_period = '2020' and Pct_managed_drinking_water_services <= 50

 * mysql+pymysql://root:***@localhost:3306/united_nations
3 rows affected.

[('South Sudan', 2020, Decimal('48.33'), Decimal('22.33'), Decimal('10.606227'), None),
 ('Central African Republic', 2020, Decimal('38.33'), Decimal('15.00'), Decimal('5.343020'), Decimal('2.33')),
 ('Democratic Republic of the Congo', 2020, Decimal('47.67'), Decimal('15.33'), None, None)]

## Solutions

### Task 1: Basic Filtering with Comparison Operators

In [ ]:
%%sql
SELECT 
Country_name, 	 
Time_period, 
Pct_managed_drinking_water_services, 
Pct_managed_sanitation_services, 
Est_population_in_millions,
Est_gdp_in_billions  
FROM 
united_nations.Access_to_Basic_Services 
WHERE 
(Country_name = 'Nigeria' 
OR Country_name = 'Ethiopia' 
OR Country_name = 'Congo' 
OR Country_name = 'Egypt' 
OR Country_name = 'Tanzania' 
OR Country_name = 'Kenya' 
OR Country_name ='South Africa')
AND Time_period BETWEEN 2019 AND 2020;

### Task 2: Streamlining with the IN Operator

In [ ]:
%%sql
SELECT 
Country_name, 	 
Time_period, 
Pct_managed_drinking_water_services, 
Pct_managed_sanitation_services, 
Est_population_in_millions, 
Est_gdp_in_billions 
FROM 
united_nations.Access_to_Basic_Services 
WHERE 
Country_name IN (
        'Nigeria', 
        'Ethiopia' , 
        'Congo', 
        'Egypt', 
        'Tanzania', 
        'Kenya', 
        'South Africa'
 )
AND Time_period BETWEEN 2019 AND 2020;

### Task 3: Combining Multiple Conditions

In [ ]:
%%sql
SELECT 
Region,
Country_name, 	 
Time_period, 
Pct_managed_drinking_water_services, 
Pct_managed_sanitation_services, 
Est_population_in_millions, 
Est_gdp_in_billions 
FROM 
united_nations.Access_to_Basic_Services 
WHERE 
Time_period = 2020
AND Pct_managed_sanitation_services <= 50;

#

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/refs/heads/master/ALX_banners/ALX_Navy.png"  style="width:100px"  ;/>
</div>